# Дан диаметр окружности d. Найти ее длину L = π·d. В качестве
# значения π использовать 3.1


d = int(input());
p = int(3.14);

l = p * d;

print(l);